Repository: hazemm900/capsuleCare
Catalog: lib/core/localization/l10n/intl_*.arb
Languages: ar

# welcomeMessage
source: Welcome To CapsuleCare
ar: مرحبًا بك في كابسول كير

# appBarTitle
source: CapsuleCare
ar: كابسول كير

source: Sign Up
ar: التسجيل

source: Log In
ar: تسجيل الدخول

source: Log Out
ar: تسجيل الخروج

source: Name
ar: الاسم

# enterName
source: Enter Your Name
ar: أدخل اسمك

source: Phone
ar: الهاتف

# enterPhone
source: Enter Your Phone
ar: أدخل رقم هاتفك

source: Gender
ar: الجنس

source: age
ar: العمر

# verificationMessage
source: Verify Your Phone Number
ar: تحقق من رقم هاتفك

# authenticationMessage
source: Please Enter Your Authentication Code
ar: يرجى إدخال رمز التحقق الخاص بك

source: User Name
ar: اسم المستخدم

source: Congratulation!!
ar: تهانينا!!

# congratulationMessage
source: Your Phone Have Been Verified Successfully
ar: تم التحقق من رقم هاتفك بنجاح

# nextButton
source: Next
ar: التالي

# continueButton
source: Continue
ar: استمرار

# noMedicineEntered
source: No Medicine Entered Yet
ar: لم يتم إدخال أي دواء بعد

source: Medicine Name
ar: اسم الدواء

source: Time
ar: الوقت

source: Total Number Of Capsules
ar: العدد الكلي للكبسولات

source: Remainder Of Capsules
ar: الباقي من الكابسولات

# howManyTimesToPick
source: How Many Times To Pick Capsules
ar: كم عدد مرات اخذ الكبسولات

source: Medicine Details
ar: تفاصيل الدواء

source: Schedule
ar: الجدول

source: Capsule Calculator
ar: حساب الكبسولات

# total
source: Total Capsules
ar: الإجمالي الاقراص

source: Picking Time
ar: اختيار الوقت

source: Set Alarm
ar: ضبط المنبه

source: Settings
ar: الإعدادات

source: Dark Mode
ar: الوضع الداكن

source: Language
ar: اللغة

# rating
source: Rate Us
ar: قيمنا

source: Add New Medicine
ar: إضافة دواء جديد

source: Search
ar: بحث

source: Capsules Alarm
ar: تنبيه الكبسولات

source: Edit Medicine
ar: تعديل الدواء

source: Delete Medicine
ar: حذف الدواء

source: Male
ar: ذكر

source: Female
ar: انثي

# genderSelection
source: Choose Your Gender
ar: اختار جنسك

source: Birthday
ar: عيد ميلادك

# doNotHaveAccount
source: ..........Don't Have An Acoount?..........
ar: ..........ليس لديك حساب؟..........

# enterAuthCode
source: Please Enter Your Authentication Code
ar: من فضلك ادخل كود المصادقة

# homePageButton
source: Home Page
ar: الصفحة الرئيسية

source: Welcome
ar: مرحبا

# profile
source: Profile Page
ar: الصفحة الشخصية

source: Enter Medicine Name
ar: ادخل اسم الدواء

# enterCapsuleNum
source: Enter Capsule Number
ar: ادخل عدد الاقراص

source: Done
ar: تم

source: Alarm Time
ar: وقت التنبيه

source: Is Recurring
ar: هل يتم التكرار

source: Add New Alarm ?
ar: اضافة منبه اخر ؟

source: Delete Medicine Failed
ar: فشل حذف الدواء

# noAlarmsSet
source: No Alarm Set Yet
ar: لم يتم ضبط منبه

source: Alarm Deleted
ar: تم حذف المنبه

source: Delete Alarm Failed
ar: فشل حذف المنبه

source: Alarm Updated
ar: تم تعديل المنبه

source: Alarm Added
ar: تم اضافة المنبه

source: Update Alarm Failed
ar: فشل تعجيل المنبه

source: Add Alarm Failed
ar: فشلت اضافة المنبه

source: Fill All Fields
ar: من فضلك املئ الحقول

source: Ensure Valid Numbers
ar: تأكد من صحة الارقام

source: Medicine Reminder
ar: تذكير بالدواء

source: Time To Take Medicine
ar: وقت تناول الدواء

source: Repeat Alarm
ar: تكرار المنبه

source: English
ar: اللغة الانجليزية

source: Arabic
ar: اللغة العربية

source: Take Medicine Now
ar: اخذ الدواء الان

source: Some Thing Went Wrong
ar: حدث خطأ

source: update Failed
ar: فشل التعديل

source: Update Success
ar: تم التعديل بنجاح

source: All Fields Required
ar: جميع الحقول مطلوبة

source: No capsules left!
ar: لم يتبقي كابسولات !

# homeNavigation
source: Home
ar: الصفحة الرئيسية

# profileNavigation
source: Profile
ar: الصفحة الشخصية

# archiveNavigation
source: archive
ar: الارشيف

# notificationNavigation
source: Notifications
ar: الاشعارات

source: Alarm At
ar: وقت التنبيه في

source: No Medicines Have Finished.
ar: لا يوجد ادوية منتهية.

source: Alert
ar: تنبيه

source: Some Medicines Have Finished.
ar: بعض الادوية انتهت.

source: Renew Medicine
ar: تجديد الدواء

source: Low Capsule Notifications
ar: اشعارات الكبسولات المنخفضة

source: All Medicines Have Enough Capsules.
ar: تحتوي جميع الادوية علي كبسولات كافية

source: Capsules Remaining:
ar: باقي الكابسولات:

# noMedicinesAdded
source: No Medicine Added Yet.
ar: لم يتم اضافة ادوية بعد.

source: Medicine Deleted Successfully
ar: تم حذف الدواء بنجاح

source: Medicine Added Successfully
ar: تم اضافة الدواء بنجاح

source: Medicine Add Failed
ar: فشل اضافة الدواء

source: Operation Failed
ar: فشلة العملية

source: Search For Medicine
ar: البحث عن دواء

source: No Medicine Found !!
ar: لم يتم العثور علي الدواء !!

source: What Medicine Are You Searching For ?
ar: ما الدواء الذي تريد البحث عنه ؟
